# OrientWithEdge Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointOnEdgeFaceIntersection..::..OrientWithEdge Property
PointOnEdgeFaceIntersection Class See Also
---
Whether to orient the ReferencePoint to the edge or the face.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool OrientWithEdge { get; set; }
```

Visual Basic
---
```text
Public Property OrientWithEdge As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool OrientWithEdge {
	bool get ();
	void set (bool value);
}
```

# Remarks
If true, the X basis vector will be parallel to the edge. If false, the X and Y basis vectors will be parallel to the face.
# See Also
PointOnEdgeFaceIntersection Class
Autodesk.Revit.DB Namespace